
&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
	ПараметрыОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда // Если контрагент заполнен иначе просто выведем все не помеченные на удаление документы
		ПараметрыОтбора.Вставить("Владелец", Объект.Контрагент);
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	Форма = ОткрытьФорму("Справочник.Договоры.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Договоры") Тогда
		
		Объект.Договор = ВыбранноеЗначение;
		
	КонецЕсли;

КонецПроцедуры 
