
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Склад = Параметры.Склад;
	
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимыОткрытияФормы(Команда)
	
	//ОткрытьФорму("Отчет.НастройкиКомпоновкиДанных.Форма",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ОткрытьФормуМодально("Отчет.НастройкиКомпоновкиДанных.Форма",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестНаСервере()
	
	НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	
КонецПроцедуры








