
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)//параметр команды это справочник ссылка контрагенты
	ПараметрыФормы = Новый Структура("ПравоеЗначениеОтбора", ПараметрКоманды); //передаем в параметре формы правое значение для отбора
	ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаСпискаУправляемая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры