
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	НастройкаНачальнойСтраницы();
	УстановитьКомпактноеОтображение();
	
КонецПроцедуры

Процедура НастройкаНачальнойСтраницы()

	ВерсияИБ  = Константы.ВерсияИБ.Получить();
	Если ВерсияИБ = "" Тогда
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ОбновлениеИнформационнойБазы.Форма.ПервыйЗапуск");
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
		
	ИначеЕсли ВерсияИБ <> Метаданные.Версия Тогда
		
		НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницыПользователя", , НастройкиНачальнойСтраницы);
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ОбновлениеИнформационнойБазы.Форма.Обновление");		
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьКомпактноеОтображение()

	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	Настройки.ВариантМасштабаФормКлиентскогоПриложения =  ВариантМасштабаФормКлиентскогоПриложения.Обычный;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", , Настройки);

КонецПроцедуры





